In [5]:
import os
import pymysql
import pandas as pd
password = os.environ.get('MYSQL_PASSWORD')

In [6]:
password = os.environ.get('MYSQL_PASSWORD')

try:
    con = pymysql.connect(
    host='localhost',
    user='root',
    password=password,
    charset='utf8mb4'
    )
    print("Connection to the database was successful!")
except pymysql.Error as e:
    print(f"An error occurred while connecting to the database: {e}")

Connection to the database was successful!

In [7]:
# calling this function makes life easy and just need to pass the name of the database I want to make a query on
def connector (database, password=password, host='localhost', 
               user='root', charset='utf8mb4',):
    
    conn = pymysql.connect(
                        host=host,
                        user=user,
                        password=password,
                        charset=charset, 
                        database=database)
    
    return conn

In [8]:
con = connector ('sql_inventory')
df = pd.read_sql("SELECT * FROM products", con)
df

   product_id                          name  quantity_in_stock  unit_price
0           1             Foam Dinner Plate                 70        1.21
1           2     Pork - Bacon,back Peameal                 49        4.65
2           3      Lettuce - Romaine, Heart                 38        3.35
3           4  Brocolinni - Gaylan, Chinese                 90        4.53
4           5        Sauce - Ranch Dressing                 94        1.63
5           6                Petit Baguette                 14        2.39
6           7             Sweet Pea Sprouts                 98        3.29
7           8      Island Oasis - Raspberry                 26        0.74
8           9                        Longan                 67        2.26
9          10                  Broom - Push                  6        1.09

In [38]:
con = connector ('sql_store')

In [39]:
df = pd.read_sql("SELECT * \
                 FROM customers \
                 WHERE birth_date>'1990-01-01'\
                 ORDER BY last_name", 
                 con)
df

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
1,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
2,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073

In [46]:
df = pd.read_sql("SELECT first_name, last_name \
                    FROM customers", 
                    con)
df

  first_name   last_name
0     Babara  MacCaffrey
1       Ines  Brushfield
2     Freddi      Boagey
3      Ambur   Roseburgh
4    Clemmie    Betchley
5       Elka    Twiddell
6      Ilene      Dowson
7    Thacher      Naseby
8     Romola      Rumgay
9       Levy      Mynett

In [47]:
df = pd.read_sql("SELECT last_name, first_name \
                    FROM customers", 
                    con)
df

    last_name first_name
0  MacCaffrey     Babara
1  Brushfield       Ines
2      Boagey     Freddi
3   Roseburgh      Ambur
4    Betchley    Clemmie
5    Twiddell       Elka
6      Dowson      Ilene
7      Naseby    Thacher
8      Rumgay     Romola
9      Mynett       Levy

In [67]:
pd.read_sql("SELECT first_name, last_name, points, points*10 AS '10x POINTS' \
            FROM customers", con)

  first_name   last_name  points  10x POINTS
0     Babara  MacCaffrey    2273       22730
1       Ines  Brushfield     947        9470
2     Freddi      Boagey    2967       29670
3      Ambur   Roseburgh     457        4570
4    Clemmie    Betchley    3675       36750
5       Elka    Twiddell    3073       30730
6      Ilene      Dowson    1672       16720
7    Thacher      Naseby     205        2050
8     Romola      Rumgay    1486       14860
9       Levy      Mynett     796        7960

In [76]:
pd.read_sql("SELECT DISTINCT state FROM customers", con)

  state
0    MA
1    VA
2    CO
3    FL
4    TX
5    IL
6    TN
7    CA
8    GA

In [77]:
con = connector ('sql_inventory')

In [81]:
pd.read_sql("SELECT name, unit_price, unit_price * 1.1 AS 'new price' \
            FROM products", con)

                           name  unit_price  new price
0             Foam Dinner Plate        1.21      1.331
1     Pork - Bacon,back Peameal        4.65      5.115
2      Lettuce - Romaine, Heart        3.35      3.685
3  Brocolinni - Gaylan, Chinese        4.53      4.983
4        Sauce - Ranch Dressing        1.63      1.793
5                Petit Baguette        2.39      2.629
6             Sweet Pea Sprouts        3.29      3.619
7      Island Oasis - Raspberry        0.74      0.814
8                        Longan        2.26      2.486
9                  Broom - Push        1.09      1.199

In [82]:
con = connector('sql_store')

In [83]:
pd.read_sql("SELECT * FROM customers WHERE points>3000", con)

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
1,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073

In [87]:
pd.read_sql('SELECT * FROM customers WHERE state != "VA"', con)

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,1,Babara,MacCaffrey,1986-03-28,781-932-9754,0 Sage Terrace,Waltham,MA,2273
1,3,Freddi,Boagey,1985-02-07,719-724-7869,251 Springs Junction,Colorado Springs,CO,2967
2,4,Ambur,Roseburgh,1974-04-14,407-231-8017,30 Arapahoe Terrace,Orlando,FL,457
3,5,Clemmie,Betchley,1973-11-07,None,5 Spohn Circle,Arlington,TX,3675
4,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
5,7,Ilene,Dowson,1964-08-30,615-641-4759,50 Lillian Crossing,Nashville,TN,1672
6,8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
7,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486
8,10,Levy,Mynett,1969-10-13,404-246-3370,68 Lawn Avenue,Atlanta,GA,796

In [89]:
pd.read_sql("SELECT * FROM customers WHERE birth_date > '1990-01-01'", con)

,customer_id,first_name,last_name,birth_date,phone,address,city,state,points
0,6,Elka,Twiddell,1991-09-04,312-480-8498,7 Manley Drive,Chicago,IL,3073
1,8,Thacher,Naseby,1993-07-17,941-527-3977,538 Mosinee Center,Sarasota,FL,205
2,9,Romola,Rumgay,1992-05-23,559-181-3744,3520 Ohio Trail,Visalia,CA,1486

In [91]:
# to get my tables' names in the datanase

query = "SELECT table_name FROM information_schema.tables WHERE table_schema='sql_store';"

# Execute the query and store the results in a Pandas DataFrame
tables = pd.read_sql_query(query, con)

# Print the list of tables
print(tables)

         TABLE_NAME
0         customers
1  order_item_notes
2       order_items
3    order_statuses
4            orders
5          products
6          shippers

In [98]:
pd.read_sql("SELECT * FROM orders WHERE order_date>='2019-01-01'", con)

   order_id  customer_id  order_date  status comments shipped_date shipper_id
0         1            6  2019-01-30       1     None         None       None